/*
Объектно-ориентированное программирование (лекции)
Урок 4. ООП: Обобщения
https://gb.ru/lessons/414492

На лекции:

1. О том, что это и зачем
2. Параметризованные типы. Классы и Методы
3. Построение иерархий обобщений
4. Примеры использования
5. Итоги


Жизненная необходимость «Type save»
Ошибки компиляции лучше ошибок выполнения
Переиспользование кода «Reusable Code»
Не нужно писать много одинакового кода, 
привязку типа можно вынести, как уровень абстракции
Проектирование уровня экземпляров класса
Не работает для статики

 */

