/*
Объектно-ориентированное программирование (семинары)
Урок 2. Принципы ООП Абстракция и интерфейсы. 

https://gb.ru/lessons/414497/homework

Домашнее задание (ДЗ-2)

Реализовать класс Market и все методы, которые он обязан реализовывать. 
Методы из интерфейса QueueBehaviour, имитируют работу очереди, 
MarketBehaviour – помещает и удаляет человека из очереди, 
метод update – обновляет состояние магазина (принимает и отдает заказы)


<<class>>
Market

void: acceptToMarket 
void: acceptToMarket 
void: acceptToMarket


Реализация (класс "Market")

 * "QueueBehaviour" - алгоритм очереди
 * ("queue" - поле очереди)
 * "MarketBehaviour" - магазин, алгоритм поведения
 * ("market" - поле магазина)
 * прописать поля в ArrayList 
 * "Market" взаимодействует с полями
 */

